; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 76679 2 1 2 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	spectrograph1 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star1 - direction
	Star0 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 infrared0)
	(have_image Planet9 spectrograph1)
	(have_image Star10 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite1 star8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star8)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite1 star0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star0)
   goals met: 0 of 5
6. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 5
7. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 1 of 5
9. (turn_to satellite1 star8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star8)
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 5
11. (take_image satellite1 star8 instrument1 infrared0)
   added: (have_image star8 infrared0)
   goals met: 2 of 5
12. (turn_to satellite1 star10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star10)
   goals met: 2 of 5
13. (take_image satellite0 phenomenon7 instrument0 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 3 of 5
14. (take_image satellite1 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 4 of 5
15. (turn_to satellite1 phenomenon6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 5
16. (take_image satellite1 phenomenon6 instrument1 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 5 of 5
